In [1]:
# Part 1. 
# 3. Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:\Users\Nurse Blum\Instacart Basket Analysis'
path

'C:\\Users\\Nurse Blum\\Instacart Basket Analysis'

In [3]:
# Data Wrangling
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_cust.shape

(206209, 10)

In [6]:
# Renaming columns to make them consistent
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [7]:
df_cust.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [8]:
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [9]:
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [10]:
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [11]:
df_cust.rename(columns = {'n_dependants' : 'dependants'}, inplace = True)

In [12]:
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [13]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
df_cust.describe()

             user_id            age     dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [15]:
# Making user_id a string
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [16]:
df_cust['user_id'].dtype

dtype('O')

In [17]:
# Data consistency checks
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      194950 non-null  object
 2   last_name       206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(3), object(7)
memory usage: 15.7+ MB

In [18]:
# Check for missing values
df_cust.isnull().sum()

user_id               0
first_name        11259
last_name             0
gender                0
state                 0
age                   0
date_joined           0
dependants            0
marital_status        0
income                0
dtype: int64

In [19]:
df_cust.shape

(206209, 10)

In [20]:
# Locate columns with missing data
df_cust_2 = df_cust[df_cust['first_name'].isnull() == True]

In [21]:
df_cust_2

,user_id,first_name,last_name,gender,state,age,date_joined,dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [22]:
# Create new file without missing data
df_cust_2 = df_cust[df_cust['first_name'].isnull() == False]

In [23]:
df_cust_2.shape

(194950, 10)

In [24]:
# Find duplicate records
df_dup = df_cust_2[df_cust_2.duplicated()]

In [25]:
df_dup

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, dependants, marital_status, income]
Index: []

In [28]:
# No duplicates found
# Joining df_cust_2 with orders_products_grouped
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_new_imp.pkl'))

In [29]:
ords_prods.head()

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,BusiestDay,Busiest days,Busiest day,Most Orders,max_order,loyalty_flag,avg_price,spend_flag,order_freq,freq_flag
0,1,1,2398795,1,2,3,7,15.0,196,1,...,Regularly busy,Regular busy,Regularly busy,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
1,2,2,473747,1,3,3,12,21.0,196,1,...,Regularly busy,Regular busy,Regularly busy,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
2,3,3,2254736,1,4,4,7,29.0,196,1,...,Least busy,Least busy,Least busy,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
3,4,4,431534,1,5,4,15,28.0,196,1,...,Least busy,Least busy,Least busy,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
4,5,5,3367565,1,6,2,7,19.0,196,1,...,Regularly busy,Regular busy,Regularly busy,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer

In [30]:
ords_prods.shape

(30328763, 28)

In [31]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30328763 entries, 0 to 30328762
Data columns (total 28 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0.1            int64
 1   Unnamed: 0_x            int64
 2   order_id                int64
 3   user_id                 int64
 4   order_number            int64
 5   orders_day_of_week      int64
 6   order_hour_of_day       int64
 7   days_since_prior_order  float64
 8   product_id              int64
 9   add_to_cart_order       int64
 10  reordered               int64
 11  _merge                  category
 12  Unnamed: 0_y            int64
 13  product_name            object
 14  aisle_id                int64
 15  department_id           int64
 16  prices                  float64
 17  price_range_loc         object
 18  BusiestDay              object
 19  Busiest days            object
 20  Busiest day             object
 21  Most Orders             object
 22  max_order               int64
 23  loyalty_flag            object
 24  avg_price               float64
 25  spend_flag              object
 26  order_freq              float64
 27  freq_flag               object
dtypes: category(1), float64(4), int64(14), object(9)
memory usage: 6.4+ GB

In [32]:
ords_prods[['user_id', 'order_id', 'department_id']] = ords_prods[['user_id', 'order_id', 'department_id']].astype('str')

In [33]:
ords_prods_cust = ords_prods.merge(df_cust_2, on = 'user_id', how = 'inner')

In [34]:
ords_prods_cust.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers.pkl'))